Sonair-AS/mcupsdk-core-k3/examples/drivers/i2c/i2c_read/am275x-evm/c75ss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM275x" --part "AM2754" --package "ANJ" --context "c75ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2754" --package "FCCSP (ANJ)" --context "c75ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const i2c         = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1        = i2c.addInstance();
const uart        = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1       = uart.addInstance();
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mmu_armv8   = scripting.addModule("/kernel/dpl/mmu_armv8", {}, false);
const mmu_armv81  = mmu_armv8.addInstance();
const mmu_armv82  = mmu_armv8.addInstance();
const mmu_armv83  = mmu_armv8.addInstance();
const mmu_armv84  = mmu_armv8.addInstance();
const mmu_armv85  = mmu_armv8.addInstance();
const mmu_armv86  = mmu_armv8.addInstance();
const mmu_armv87  = mmu_armv8.addInstance();
const mmu_armv88  = mmu_armv8.addInstance();
const mmu_armv89  = mmu_armv8.addInstance();
const mmu_armv810 = mmu_armv8.addInstance();
const mmu_armv811 = mmu_armv8.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
i2c1.$name           = "CONFIG_I2C0";
i2c1.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template0";

uart1.$name        = "CONFIG_UART0";
uart1.UART.$assign = "UART3";

debug_log.enableUartLog = true;
debug_log.uartLog.$name = "CONFIG_UART1";

mmu_armv81.size  = 0x20000000;
mmu_armv81.$name = "REGISTERS_REGION0";

mmu_armv82.vAddr = 0x20000000;
mmu_armv82.pAddr = 0x20000000;
mmu_armv82.size  = 0x20000000;
mmu_armv82.$name = "REGISTERS_REGION1";

mmu_armv83.vAddr = 0x40000000;
mmu_armv83.pAddr = 0x40000000;
mmu_armv83.size  = 0x20000000;
mmu_armv83.$name = "REGISTERS_REGION2";

mmu_armv84.vAddr = 0x60000000;
mmu_armv84.pAddr = 0x60000000;
mmu_armv84.size  = 0x10000000;
mmu_armv84.$name = "REGISTERS_REGION3";

mmu_armv85.vAddr = 0x7C200000;
mmu_armv85.pAddr = 0x7C200000;
mmu_armv85.$name = "CLEC";
mmu_armv85.size  = 0x100000;

mmu_armv86.$name = "DRU";
mmu_armv86.vAddr = 0x7C400000;
mmu_armv86.pAddr = 0x7C400000;
mmu_armv86.size  = 0x300000;

mmu_armv87.$name     = "CCS_DEBUG_LOG_MEM";
mmu_armv87.size      = 0x1000;
mmu_armv87.attribute = "MAIR4";
mmu_armv87.pAddr     = 0x8027F000;
mmu_armv87.vAddr     = 0x8027F000;

mmu_armv88.$name     = "L2SRAM";
mmu_armv88.vAddr     = 0x7E000000;
mmu_armv88.pAddr     = 0x7E000000;
mmu_armv88.attribute = "MAIR7";
mmu_armv88.size      = 0x200000;

mmu_armv89.$name     = "L2SRAM_AUX";
mmu_armv89.vAddr     = 0x7E200000;
mmu_armv89.pAddr     = 0x7E200000;
mmu_armv89.size      = 0x40000;
mmu_armv89.attribute = "MAIR7";

mmu_armv810.attribute = "MAIR7";
mmu_armv810.$name     = "MSRAM_BANK0_TO_BANK3";
mmu_armv810.vAddr     = 0x80000000;
mmu_armv810.pAddr     = 0x80000000;
mmu_armv810.size      = 0x400000;

mmu_armv811.$name     = "MSRAM_BANK4_TO_BANK5";
mmu_armv811.size      = 0x200000;
mmu_armv811.attribute = "MAIR7";
mmu_armv811.vAddr     = 0x80400000;
mmu_armv811.pAddr     = 0x80400000;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.$suggestSolution                   = "I2C1";
i2c1.I2C.SCL.$suggestSolution               = "I2C1_SCL";
i2c1.I2C.SDA.$suggestSolution               = "I2C1_SDA";
uart1.UART.RXD.$suggestSolution             = "MCASP0_AXR8";
uart1.UART.TXD.$suggestSolution             = "GPIO1_47";
debug_log.uartLog.UART.$suggestSolution     = "UART0";
debug_log.uartLog.UART.RXD.$suggestSolution = "MCASP4_AXR0";
debug_log.uartLog.UART.TXD.$suggestSolution = "MLB0_MLBCLK";
